blog_project_2/app/views/articles/index.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 2]]
---
<% @current_user.articles.each do |article| %>