blog_project_2/app/views/users/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]
---
<ul>
<% @current_user.articles.each do |article| %>