blog_project_2/app/controllers/articles_controller.rb

  def create
    new_article = params.require(:article).permit(:title, :content)
    article = current_user.articles.create(new_article)
---
INSERT INTO "articles" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    article_id = params[:id]
    article = Article.find(article_id)
    updated_attributes = params.require(:article).permit(:title, :content)
    article.update_attributes(updated_attributes)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "articles" SET "content" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["content", "This is the content of Article Number 2.  It's fantastic fun, and everyone should try it"], ["updated_at", "2015-01-18 22:04:01.514485"], ["id", 4]]

  def destroy
    article = Article.find(params[:id])
    article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 3]]